# 5장 pandas 시작하기
# 5-2 핵심기능

In [1]:
from pandas import Series, DataFrame
import pandas as pd
import numpy as np

> #### 1. 재색인

In [2]:
obj = Series([4.5, 7.2, -5.3, 3.6], index = ['d', 'b', 'a', 'c'])
obj

d    4.5
b    7.2
a   -5.3
c    3.6
dtype: float64

In [3]:
obj2 = obj.reindex(['a', 'b', 'c', 'd', 'e'])
obj2

a   -5.3
b    7.2
c    3.6
d    4.5
e    NaN
dtype: float64

In [4]:
obj.reindex(['a', 'b', 'c', 'd', 'e'], fill_value = 0)

a   -5.3
b    7.2
c    3.6
d    4.5
e    0.0
dtype: float64

index는 reindex 함수를 사용해서 업데이트가 가능하며, NA 값은 fill_value 명령어를 통해 대체할 수 있음

In [5]:
obj3 = Series(['blue', 'purple', 'yellow'], index = [0, 2, 4])
obj3

0      blue
2    purple
4    yellow
dtype: object

In [8]:
obj3.reindex(range(6), method = 'ffill')

0      blue
1      blue
2    purple
3    purple
4    yellow
5    yellow
dtype: object

ffill 또는 bfill 메서드를 사용하여 세련된 방법으로 보간 가능

In [9]:
frame = DataFrame(np.arange(9).reshape((3,3)),
                  index = ['a', 'b', 'c'],
                 columns = ['Ohio', 'Texas', 'California'])
frame

   Ohio  Texas  California
a     0      1           2
b     3      4           5
c     6      7           8

In [10]:
frame2 = frame.reindex(['a', 'b', 'c', 'd'])
frame2

   Ohio  Texas  California
a   0.0    1.0         2.0
b   3.0    4.0         5.0
c   6.0    7.0         8.0
d   NaN    NaN         NaN

In [11]:
states = ['Texas', 'Utah', 'California']
frame.reindex(columns = states)

   Texas  Utah  California
a      1   NaN           2
b      4   NaN           5
c      7   NaN           8

In [15]:
frame.reindex(index = ['a', 'b', 'c', 'd'],
             method = 'ffill')
             #columns = states)

   Ohio  Texas  California
a     0      1           2
b     3      4           5
c     6      7           8
d     6      7           8

In [19]:
frame.loc[['a','b','c','d'], states]

   Texas  Utah  California
a    1.0   NaN         2.0
b    4.0   NaN         5.0
c    7.0   NaN         8.0
d    NaN   NaN         NaN

> #### 2. 하나의 로우 또는 칼럼 삭제하기

In [20]:
obj = Series(range(5), index = ['a', 'b', 'c', 'd', 'e'])
obj

a    0
b    1
c    2
d    3
e    4
dtype: int32

In [21]:
new_obj = obj.drop('c')
new_obj

a    0
b    1
d    3
e    4
dtype: int32

In [22]:
obj.drop(['c', 'd'])

a    0
b    1
e    4
dtype: int32

___

In [23]:
data = DataFrame(np.arange(16).reshape(4,4),
                index = ['Ohio', 'Colorado', 'Utah', 'New York'],
                columns = ['One', 'two', 'three', 'four'])
data

          One  two  three  four
Ohio        0    1      2     3
Colorado    4    5      6     7
Utah        8    9     10    11
New York   12   13     14    15

In [24]:
data.drop(['Colorado', 'Ohio'])

          One  two  three  four
Utah        8    9     10    11
New York   12   13     14    15

In [26]:
data.drop('two', axis = 1)

          One  three  four
Ohio        0      2     3
Colorado    4      6     7
Utah        8     10    11
New York   12     14    15

In [27]:
data.drop(['two', 'three'], axis = 1)

          One  four
Ohio        0     3
Colorado    4     7
Utah        8    11
New York   12    15

DataFrame에서는 row와 column 모두 drop 가능

> #### 3. 색인하기, 선택하기, 거르기

> #### 4. 산술연산과 데이터 정렬

> #### 5. 함수 적용과 매핑

> #### 6. 정렬과 순위

> #### 7. 중복 색인